[GrimyGameState_Unit_TrainingRoulette]
+DisplayName="Roulette"
+ClassSummary="A class with randomized weapons and abilities."
+LeftAbilityTreeTitle="Coin Flip"
+RightAbilityTreeTitle="Dice Roll"

RandomNickNames[0]="Apex"
RandomNickNames[1]="Ace"
RandomNickNames[2]="Aftermath"
RandomNickNames[3]="Alpha"
RandomNickNames[4]="Blackjack"
RandomNickNames[5]="Bullseye"
RandomNickNames[6]="Bolt"
RandomNickNames[7]="Big Shot"
RandomNickNames[8]="Big Sleep"
RandomNickNames[9]="Big Time"
RandomNickNames[10]="Boss"
RandomNickNames[11]="Bullseye"
RandomNickNames[12]="Checkmate"
RandomNickNames[13]="Chief"
RandomNickNames[14]="Colt"
RandomNickNames[15]="Dallas"
RandomNickNames[16]="Deadbolt"
RandomNickNames[17]="Deadeye"
RandomNickNames[18]="Deadlock"
RandomNickNames[19]="Deadwood"
RandomNickNames[20]="D.O.A."
RandomNickNames[21]="Eagle Eye"
RandomNickNames[22]="Eight Ball"
RandomNickNames[23]="Flatline"
RandomNickNames[24]="Game Time"
RandomNickNames[25]="Gangster"
RandomNickNames[26]="Grave Digger"
RandomNickNames[27]="Hat Trick"
RandomNickNames[28]="Hawkeye"
RandomNickNames[29]="Heater"
RandomNickNames[30]="High Noon"
RandomNickNames[31]="Hitman"
RandomNickNames[32]="Hollywood"
RandomNickNames[33]="Hype"
RandomNickNames[34]="Icon"
RandomNickNames[35]="Jackal"
RandomNickNames[36]="Judge"
RandomNickNames[37]="Lights Out"
RandomNickNames[38]="Lockdown"
RandomNickNames[39]="Long Shot"
RandomNickNames[40]="Longwalker"
RandomNickNames[41]="Needle"
RandomNickNames[42]="Pale Rider"
RandomNickNames[43]="Reaper"
RandomNickNames[44]="Scratch"
RandomNickNames[45]="Serial"
RandomNickNames[46]="Sheriff"
RandomNickNames[47]="Shooter"
RandomNickNames[48]="Showtime"
RandomNickNames[49]="Slick"
RandomNickNames[50]="Slinger"
RandomNickNames[51]="Stonecold"
RandomNickNames[52]="The Cleaner"
RandomNickNames[53]="The Kid"
RandomNickNames[54]="The Truth"
RandomNickNames[55]="Tombstone"
RandomNickNames[56]="Top Notch"
RandomNickNames[57]="Top Shelf"
RandomNickNames[58]="Two Tap"
RandomNickNames[59]="Undertaker"
RandomNickNames[60]="Valentine"

RandomNickNames[61]="All Day"
RandomNickNames[62]="All In"
RandomNickNames[63]="Animal"
RandomNickNames[64]="Baller"
RandomNickNames[65]="Big Country"
RandomNickNames[66]="Big Money"
RandomNickNames[67]="Big Nasty"
RandomNickNames[68]="Blaze"
RandomNickNames[69]="Boom Boom"
RandomNickNames[70]="Boomer"
RandomNickNames[71]="Bomber"
RandomNickNames[72]="Bulldog"
RandomNickNames[73]="Bull Rush"
RandomNickNames[74]="Claymore"
RandomNickNames[75]="Demo"
RandomNickNames[76]="Defcon"
RandomNickNames[77]="Devil Dog"
RandomNickNames[78]="Diesel"
RandomNickNames[79]="Encore"
RandomNickNames[80]="Fireball"
RandomNickNames[81]="Fridge"
RandomNickNames[82]="Gunner"
RandomNickNames[83]="Hammer"
RandomNickNames[84]="Hellfire"
RandomNickNames[85]="Hightower"
RandomNickNames[86]="Hoss"
RandomNickNames[87]="Volcano"
RandomNickNames[88]="Hurricane"
RandomNickNames[89]="Junkyard"
RandomNickNames[90]="Juggernaut"
RandomNickNames[91]="Knockout"
RandomNickNames[92]="Kong"
RandomNickNames[93]="Mad Dog"
RandomNickNames[94]="Meltdown"
RandomNickNames[95]="Moose"
RandomNickNames[96]="Nova"
RandomNickNames[97]="Nitro"
RandomNickNames[98]="Nukes"
RandomNickNames[99]="Ogre"
RandomNickNames[100]="Pitbull"
RandomNickNames[101]="Pyro"
RandomNickNames[102]="Redline"
RandomNickNames[103]="Rhino"
RandomNickNames[104]="Rocket"
RandomNickNames[105]="Seabreeze"
RandomNickNames[106]="Slab"
RandomNickNames[107]="Smash"
RandomNickNames[108]="Spitfire"
RandomNickNames[109]="Smokey"
RandomNickNames[110]="Swamp Thing"
RandomNickNames[111]="T-Bone"
RandomNickNames[112]="T-Rex"
RandomNickNames[113]="Tank"
RandomNickNames[114]="Thumper"
RandomNickNames[115]="Thunder"
RandomNickNames[116]="Tickle"
RandomNickNames[117]="Tiny"
RandomNickNames[118]="Titan"
RandomNickNames[119]="Dynamite"
RandomNickNames[120]="Torch"
RandomNickNames[121]="Wardog"
RandomNickNames[122]="Warhorse"
RandomNickNames[123]="Wildchild"

RandomNickNames[124]="Angel"
RandomNickNames[125]="Beta"
RandomNickNames[126]="Bishop"
RandomNickNames[127]="Bones"
RandomNickNames[128]="Breaker"
RandomNickNames[129]="Broker"
RandomNickNames[130]="Crypto"
RandomNickNames[131]="Cyber"
RandomNickNames[132]="Cypher"
RandomNickNames[133]="Data"
RandomNickNames[134]="Deacon"
RandomNickNames[135]="Dr. Feelgood"
RandomNickNames[136]="Doc"
RandomNickNames[137]="Feedback"
RandomNickNames[138]="Firewall"
RandomNickNames[139]="Genius"
RandomNickNames[140]="Gizmo"
RandomNickNames[141]="Glitch"
RandomNickNames[142]="Hijack"
RandomNickNames[143]="Jammer"
RandomNickNames[144]="Jester"
RandomNickNames[145]="Jolt"
RandomNickNames[146]="Lightning"
RandomNickNames[147]="Mayday"
RandomNickNames[148]="Mega"
RandomNickNames[149]="Newton"
RandomNickNames[150]="Overdrive"
RandomNickNames[151]="Patch"
RandomNickNames[152]="Professor"
RandomNickNames[153]="Ragtime"
RandomNickNames[154]="Rascal"
RandomNickNames[155]="Rattler"
RandomNickNames[156]="Red"
RandomNickNames[157]="Rift"
RandomNickNames[158]="Ripcord"
RandomNickNames[159]="Rogue"
RandomNickNames[160]="Scorch"
RandomNickNames[161]="Sentinel"
RandomNickNames[162]="Shady"
RandomNickNames[163]="Shakes"
RandomNickNames[164]="Shifter"
RandomNickNames[165]="Shrink"
RandomNickNames[166]="Slider"
RandomNickNames[167]="Solar"
RandomNickNames[168]="Sonar"
RandomNickNames[169]="Sparks"
RandomNickNames[170]="Stitch"
RandomNickNames[171]="Tapper"
RandomNickNames[172]="Teardrop"
RandomNickNames[173]="Tinker"
RandomNickNames[174]="Turbo"
RandomNickNames[175]="Venom"
RandomNickNames[176]="Vapor"
RandomNickNames[177]="Warbird"
RandomNickNames[178]="Warden"
RandomNickNames[179]="Whiskey"
RandomNickNames[180]="Wild Thing"
RandomNickNames[181]="Zulu"
RandomNickNames[182]="Wiz"
RandomNickNames[183]="Witchy"
RandomNickNames[184]="Warlock"
RandomNickNames[185]="Psycho"
RandomNickNames[186]="Dirge"
RandomNickNames[187]="Echo"
RandomNickNames[188]="Ecto"
RandomNickNames[189]="Haze"
RandomNickNames[190]="Hex"
RandomNickNames[191]="Zen"
RandomNickNames[192]="Omega"
RandomNickNames[193]="Dusk"
RandomNickNames[194]="Voodoo"
RandomNickNames[195]="Hellion"
RandomNickNames[196]="Judge"
RandomNickNames[197]="Freak"
RandomNickNames[198]="Twitch"
RandomNickNames[199]="Dread"
RandomNickNames[200]="Ghoul"
RandomNickNames[201]="Oz"
RandomNickNames[202]="Null"
RandomNickNames[203]="Zero"
RandomNickNames[204]="Ouija"
RandomNickNames[205]="Prophet"
RandomNickNames[206]="Nightmare"
RandomNickNames[207]="Viper"
RandomNickNames[208]="Spook"
RandomNickNames[209]="Demon"
RandomNickNames[210]="Raven"
RandomNickNames[211]="Vader"
RandomNickNames[212]="Syndrome"
RandomNickNames[213]="Druid"
RandomNickNames[214]="Thriller"
RandomNickNames[215]="Phoenix"
RandomNickNames[216]="Midnight"
RandomNickNames[217]="Crow"
RandomNickNames[218]="Scarecrow"
RandomNickNames[219]="Vampire"
RandomNickNames[220]="Werewolf"
RandomNickNames[221]="Zombie"
RandomNickNames[222]="Firefly"
RandomNickNames[223]="Omen"
RandomNickNames[224]="Raven"
RandomNickNames[225]="Xeno"
RandomNickNames[226]="Grim"
RandomNickNames[227]="Shriek"
RandomNickNames[228]="Bandit"
RandomNickNames[229]="Blitz"
RandomNickNames[230]="Brick"
RandomNickNames[231]="Butcher"
RandomNickNames[232]="Buzzsaw"
RandomNickNames[233]="Cajun"
RandomNickNames[234]="Chops"
RandomNickNames[235]="Cobra"
RandomNickNames[236]="Cougar"
RandomNickNames[237]="Coyote"
RandomNickNames[238]="Crash"
RandomNickNames[239]="Diamond"
RandomNickNames[240]="Enforcer"
RandomNickNames[241]="Fatal"
RandomNickNames[242]="Flash"
RandomNickNames[243]="Fury"
RandomNickNames[244]="Gator"
RandomNickNames[245]="Ghost"
RandomNickNames[246]="Gunner"
RandomNickNames[247]="Hound Dog"
RandomNickNames[248]="Ice"
RandomNickNames[249]="Icepick"
RandomNickNames[250]="Jaws"
RandomNickNames[251]="Judgment Day"
RandomNickNames[252]="Knuckles"
RandomNickNames[253]="Monster"
RandomNickNames[254]="Mustang"
RandomNickNames[255]="Paladin"
RandomNickNames[256]="Pitbull"
RandomNickNames[257]="Predator"
RandomNickNames[258]="Razor"
RandomNickNames[259]="Samurai"
RandomNickNames[260]="Scorpion"
RandomNickNames[261]="Shogun"
RandomNickNames[262]="Shadow"
RandomNickNames[263]="Slayer"
RandomNickNames[264]="Snake"
RandomNickNames[265]="Snake Eyes"
RandomNickNames[266]="Solo"
RandomNickNames[267]="Specter"
RandomNickNames[268]="Spider"
RandomNickNames[269]="Stalker"
RandomNickNames[270]="Steel"
RandomNickNames[271]="Stinger"
RandomNickNames[272]="Templar"
RandomNickNames[273]="Trojan"
RandomNickNames[274]="Vandal"
RandomNickNames[275]="Viking"
RandomNickNames[276]="Warden"
RandomNickNames[277]="Warlord"
RandomNickNames[278]="Wolverine"
RandomNickNames[279]="Wildchild"
RandomNickNames[280]="Wildling"
RandomNickNames[281]="Zulu"

RandomNicknames_Male[0]="Cowboy"
RandomNickNames_Male[1]="Godfather"
RandomNickNames_Male[2]="Mailman"
RandomNickNames_Male[3]="Sandman"
RandomNickNames_Male[4]="Slim"
RandomNickNames_Male[5]="Taxman"
RandomNickNames_Male[6]="Zeus"
RandomNicknames_Male[7]="Barbarian"
RandomNickNames_Male[8]="Big Boy"
RandomNicknames_Male[9]="Boss Man"
RandomNickNames_Male[10]="Cowboy"
RandomNickNames_Male[11]="Meathead"
RandomNickNames_Male[12]="Nero"
RandomNickNames_Male[13]="Papa Bear"
RandomNickNames_Male[14]="Wildman"
RandomNickNames_Male[15]="Candyman"
RandomNickNames_Male[16]="Magic Man"
RandomNickNames_Male[17]="Priest"
RandomNickNames_Male[18]="Rainman"
RandomNickNames_Male[19]="Rooster"
RandomNickNames_Male[20]="Loki"
RandomNickNames_Male[21]="Pharoah"
RandomNicknames_Male[22]="Merlin"
RandomNicknames_Male[23]="Preacher"
RandomNickNames_Male[24]="Axeman"
RandomNickNames_Male[25]="Duke"
RandomNickNames_Male[26]="Rocky"
RandomNickNames_Male[27]="Stallion"
RandomNickNames_Male[28]="Wolfman"

RandomNickNames_Female[0]="Baroness"
RandomNickNames_Female[1]="Black Widow"
RandomNicknames_Female[2]="Calamity"
RandomNicknames_Female[3]="Queen Bee"
RandomNickNames_Female[4]="Amazon"
RandomNicknames_Female[5]="Boss Lady"
RandomNickNames_Female[6]="Cowgirl"
RandomNicknames_Female[7]="Domino"
RandomNickNames_Female[8]="Freya"
RandomNickNames_Female[9]="Mama Bear"
RandomNickNames_Female[10]="Deep Six"
RandomNickNames_Female[11]="Firebug"
RandomNickNames_Female[12]="Priestess"
RandomNickNames_Female[13]="Wolfmother"
RandomNickNames_Female[14]="Black Widow"
RandomNickNames_Female[15]="Duchess"
RandomNickNames_Female[16]="Lady Grey"
RandomNicknames_Female[17]="Sorceress"
RandomNicknames_Female[18]="Banshee"
RandomNicknames_Female[19]="Aurora"
RandomNicknames_Female[20]="Oracle"
RandomNicknames_Female[21]="Misery"
RandomNicknames_Female[22]="Morrigan"
RandomNicknames_Female[23]="Violet"
RandomNickNames_Female[24]="Athena"
RandomNickNames_Female[25]="Duchess"
RandomNicknames_Female[26]="Iron Lady"
RandomNicknames_Female[27]="Iron Maiden"
RandomNicknames_Female[28]="Shieldmaiden"
RandomNickNames_Female[29]="Valkyrie"